Repository: kzuraniewski/portfolio
Catalog: src/locales/*.po
Languages: pl_pl

source: A web app allowing the user to store links in grouped tiles
pl_pl: Aplikacja webowa pozwalająca na gromadzenie pogrupowanych linków

source: A web app simulating the Intel 8086 processor
pl_pl: Aplikacja webowa symulująca procesor Intel 8086

source: About
pl_pl: O mnie

source: About me
pl_pl: O mnie

source: Backend maintenance for E-commerce serivces using PHP
pl_pl: Utrzymywanie backendu dla serwisu E-commerce przy użyciu PHP

source: Bypassing editor limitations with hand written custom JS and CSS to improve the UI in the existing projects
pl_pl: Sporządzanie własnych skryptów JS i styli w CSS omijając ograniczenia edytora w celu udoskonalania UI w istniejących projektach

source: Companies I worked in
pl_pl: Firmy w których pracowałem

source: Contact
pl_pl: Kontakt

source: Contact me
pl_pl: Kontakt

source: Contact me at
pl_pl: Skontaktuj się pod

source: Designed and developed by Karol Żuraniewski
pl_pl: Projekt i wykonanie - Karol Żuraniewski

source: Development of UI and RPA processes with MUI and Node.js
pl_pl: Rozwój UI oraz procesów RPA przy użyciu MUI i Node.js

source: Docker logo
pl_pl: Logo Docker

source: E-commerce service development and maintenance in Wordpress
pl_pl: Rozwój i utrzymanie serwisów E-commerce przy użyciu narzędzia Wordpress

source: Example charity company's website
pl_pl: Przykładowa strona organizacji charytatywnej

source: Feb. 2022 - July 2022
pl_pl: Lut 2022 - Lip 2022

source: Get to know me
pl_pl: Poznaj mnie

source: Hi, my name is Karol. I develop web stuff.
pl_pl: Cześć, jestem Karol. Jestem web developerem.

source: Home
pl_pl: Strona główna

source: I also develop websites as a freelancer. If you are in need of one, reach out to me.
pl_pl: Zajmuję się również tworzeniem stron internetowych jako freelancer. Jeśli jesteś zainteresowany/a, skontaktuj się ze mną.

source: I am currently open to work, so if you found my portfolio interesting, feel free to contact me.
pl_pl: Jestem obecnie otwarty na propozycje współpracy, więc jeśli spodobało Ci się moje portfolio, skontaktuj się ze mną.

source: I'm a fullstack web developer that specializes in TypeScript, React and Java.
pl_pl: Jestem fullstack web developerem specjalizującym się w TypeScript, React i Java.

source: Improving and implementing new aspects related to user interfaces and SAP data processing
pl_pl: Udoskonalanie i implementowanie nowych aspektów związanych z interfejsami użytkownika i przetwarzaniem danych SAP

source: Intel 8086 Simulator
pl_pl: Symulator Intel 8086

source: Interactive Comments
pl_pl: System komentarzy

source: Interactive social media comment thread system
pl_pl: Interaktywny system komentarzy w stylu social media

source: Java logo
pl_pl: Logo Java

source: MUI logo
pl_pl: Logo MUI

source: My name is
pl_pl: Nazywam się

source: My Projects
pl_pl: Moje projekty

source: My web development journey started in 2021 - when I got to know React. Since then I've had the opportunity to design, develop and maintain websites, E-commerce services and fullstack web applications at different companies.
pl_pl: Moja przygoda z web development zaczęła się w 2021 - gdy poznałem React. Od tego czasu miałem możliwośc projektować, rozwijać oraz utrzymywać strony, serwisy E-commerce oraz fullstackowe aplikacje webowe w różnych firmach.

source: Need a website?
pl_pl: Potrzebujesz strony?

source: Node.js logo
pl_pl: Logo Node.js

source: Or call me:
pl_pl: Lub zadzwoń:

source: PDF Catalog
pl_pl: Katalog PDF

source: PDF viewer with annotation edit tool
pl_pl: Wyświetlacz PDF z narzędziem do edycji adnotacji

source: Photography portfolio website with image preview
pl_pl: Strona portfolio z galerią zdjęć i podglądem

source: Photography Website
pl_pl: Galeria zdjęć

source: Portfolio website design and development using Wordpress and React
pl_pl: Projektowanie i rozwój stron portfolio przy użyciu Wordpress oraz React

source: PostgreSQL logo
pl_pl: Logo PostgreSQL

source: Projects
pl_pl: Projekty

source: React logo
pl_pl: Logo React

source: Resume
pl_pl: Pobierz CV

source: See live
pl_pl: Otwórz

source: See more projects on my <0>GitHub</0>
pl_pl: Zobacz więcej projektów na moim <0>GitHubie</0>

source: Sep. 2022 - Aug. 2023
pl_pl: Wrz 2022 - Sie 2023

source: Technologies I've worked with
pl_pl: Technologie które wykorzystywałem

source: TypeScript logo
pl_pl: Logo TypeScript

source: Web app UI and backend development using React, Spring and PostgreSQL
pl_pl: Rozwój UI oraz backendu aplikacji webowej przy użyciu React, Sprint oraz PostgreSQL

source: What I'm learning
pl_pl: Czego się uczę

source: Wordpress logo
pl_pl: Logo Wordpress

source: Working on
pl_pl: W toku
